NextFOAM-2506/tutorials/combustion/fireFoam/LES/smallPoolFire2D/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(outlet|sides)"
    {

        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }

    base
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0.05 0);
    }

    frontAndBack
    {
        type        empty;
    }
}


// ************************************************************************* //
